
        package com.example.game;
/*
IPZ1
Осташко Романюк
Class Question
 */
        import java.util.Arrays;
        import java.util.Collections;

        public class Question {

    public String mQuestions1[]={
            "Рік заснування КМА ?",
            "Скільки поверхів у гуртожитках ?",
            "Хлопці ходять в університет Шевченка через",
            "Скільки корпусів КМА?",
            "Кого миють на день Могилянки?",
            "Не дадуть стипендію, якщо хоча один з предметів?   ",
            "Найпопулярніший музей біля КМА?",
            "Як Брюцовецький виграв Могилянку?",
            "Символ Могилянки:",
            "День народження КМА",
            "День ФІ",
            "Сомофор – це",
            "Колобки – це",
            "Сеньйор – це ",
            "Чечня – це",

    };
    private String mChoises[][]={
            {  "1635","1701","1615","1649"},
            {  "9","12","7","4"},
            {  "На олімпіади","Завалили екзамени","Військову кафедру","Займатись спортом"},
            {  "8","9","10","11"},
            {  "Студентів","Деканів","Петра Могилу","Сковороду"},
            {  "Менше 60","Менше 71","Менше 69","Менше 81"},
            {  "Чорнобиля","Музей КМА","Історії України","Гетьманства"},
            {  "Шахи","Нарди","Цу-є-фа","Покер"},
            {  "Сова","Їжачок","Черепаха","Митник"},
            {  "14 листопада","15 жовтня","9 жовтня","11 листопада"},
            {  "22 квітня","22 травня","23 квітня","23 березня"},
            {  "Перекус","Велика перерва","Другокурсник","Відпочинок"},
            {  "Коменданти Трої","Незарахи","Бадді у відрядженні","Студенти 3-го курсу"},
            {  "Викладачі","Студент ФІ","Випусники","Студенти 3-го курсу"},
            {  "Погані студенти","Іноземні студенти","Другий Плац","Троя"},

    };
    private String mCorrectAnswers[]={"1615","9","Військову кафедру","10","Сковороду","Менше 71","Чорнобиля",
            "Шахи","Черепаха","15 жовтня","22 травня","Другокурсник","Коменданти Трої","Студенти 3-го курсу","Другий Плац"

    };


    public String getQuestion(int a) {
        String question = mQuestions1[a];
        return question;
    }

    public String getChoice1(int a) {
        String choice = mChoises[a] [0];

        return choice;
    }

    public String getChoice2(int a) {
        String choice = mChoises[a] [1];
        return choice;
    }
    public String getChoice3(int a) {
        String choice = mChoises[a][2];
        return choice;
    }
    public String getChoice4(int a) {
        String choice = mChoises[a][3];
        return choice;
    }
    public String getCorrectAnswear(int a) {
        String answear = mCorrectAnswers[a];
        return answear;
    }


}