package com.example.game;

/*
IPZ1
Осташко Романюк
Class QuestionAvtor
 */
public class QuestionAvtor {

    public String mQuestions[] = {
            "Видається кредитів на рік?",
            "Середній бал для степендії ?",
            "Вищий керівний орган?",
            "Дисципліни оцінюються за шкалою в?",
            "Кого миють на день Могилянки?",
            "Не дадуть стипендію, якщо хоча один з предметів?  ",
            "Як Брюцовецький виграв Могилянку?",
            "Символ Могилянки:",
            "Кількість кредитів на бакалавраті ",
            "День ФІ",
            "День ФЕН ",
            "День ФГН ",
            "День ФПРН(природничий) ",
            "День ФПВН(право)",
            "Угоду підписують у  ",
            "Чечня – це",
            "Скільки є ТРС",
            "Доступ до якого сервісу дають студенту Могилянки?",
            "Хто допомагає фрешам з усіма питаннями на початку?",
            "Робити за когось завдання ",
            "Чого не очікують абітурієнти у КМА",
            "Оцінка D – це",
            "Кредит відповідає",
            "Хто заснував КМА:",
            "Спецназ –це ",
            "Додому додому – це ",
            "З якого року бакалаврат в Могилі",
            "Фіни – це",
            "У 2015 році Могилянці виповнилось ",
            "Гетто – це",
            "Продовжіть  «Запорожець не машина, а філолог…»",

};
private String mChoises[][]={
        {"60","45","75","90"},
        {"76+","81+","70+","71+"},
        {"Банкомат","Ректорат","Деканат","Пенсіонат"},
        {"90","50","100 балів","5"},
        {"Сковороду","Петра Могилу","Глибовця","Студентів"},
        {"Манше 81","Менше 71","Менше 91","Менше 85"},
        {"Нарди","Покер","Дурак","Шахи"},
        {"Боб","Карел","Ольма","Альма"},
        {"480","360","240","120"},
        {"11 квітня","10 червня","21 травня","22 травня"},
        {"21 лютого ","22 лютого ","21 березня","21 квітня"},
        {"25 березня","27 березня","27 квітня","25 квітня"},
        {"17 квітня","11 квітня","11 березня","17 квітня"},
        {"11 жовтня","14 жовтня","11 березня","14 березня"},
        {"липні","червні","травні","жовтні"},
        {"Перший корпус","КМЦ","Другий корпус","Столова"},
        {"4","1","3","2"},
        {"Netflix","Microsoft Office 365","Windows 10","Zoom"},
        {"Вчителі","Куратори","Охорона","Бадді"},
        {"Фрустрація","Фабрикація","Формалітизація","Фальсифікація"},
        {"Кооп угоди","Індивідуальний графік","Гарні вчителі","Гарні оцінки"},
        {"60-66","71-80","75-80","60-65"},
        {"30 годинам","20 годинам","5 годинам","24 годинам"},
        {"Сагайдачний","Сковорода","Петро Могила","Глибовець"},
        {"Спец група","Економи","Хлопці з Фі","Дівчата з Фі"},
        {"В рідне місто","Гурто","Бібліотека","Сільпо"},
        {"1992","2001","1634","1980"},
        {"Першокурсники","Ті, хто випивають","Фішники","Відмінники"},
        {"400","300","405","429"},
        {"Курилка","Незарахи","Бадді у відрядженні","Студенти 3-го курсу"},
        {"це машина","це драбина","не мужчина","не дитина"},
        };
public String mCorrectAnswers[]={"60","76+","Ректорат","100 балів","Сковороду","Менше 71","Шахи",
        "Альма","240","22 травня","21 лютого","27 березня","17 квітня","11 жовтня","жовтні","Другий корпус","2",
        "Microsoft Office 365","Бадді","Фальсифікація","Кооп угоди","66-70","30 годинам"
        ,"Петро Могила","Спец група","В рідне місто","1992","Фішники","400","Курилка","не мужчина"
        };
public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
        }

public String getChoice1(int a) {
        String choice = mChoises[a] [0];

        return choice;
        }
public String getChoice2(int a) {
        String choice = mChoises[a] [1];
        return choice;
        }
public String getChoice3(int a) {
        String choice = mChoises[a][2];
        return choice;
        }
public String getChoice4(int a) {
        String choice = mChoises[a][3];
        return choice;
        }
public String getCorrectAnswear(int a) {
        String answear = mCorrectAnswers[a];
        return answear;
        }
        }